cf_billing/Documents/энргОперацииСПериодамиОспариванияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОперацииСПериодамиОспариванияЗадолженности</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПериодыОспариванияЗадолженности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргПериодыОспариванияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПериодыОспариванияЗадолженности</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оспаривается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргОперацииСПериодамиОспариванияЗадолженности/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ГраницыПериода  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;		
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	ДополнительныеСвойства.Вставить("Кассир",				Справочники.Пользователи.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",		Истина);
	ДополнительныеСвойства.Вставить("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	ДополнительныеСвойства.Вставить("ДанныеОплаты",			ДанныеОплаты());
	
	СинхронизироватьПериодИАктивностьДвиженийСПометкойУдаления();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);			

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура СинхронизироватьПериодИАктивностьДвиженийСПометкойУдаления()
	
	СинхронизироватьПометку = Истина;
	
	Если НЕ ПометкаУдаления Тогда
		// Не помеченный на удаление документ может иметь неактивные движения.
		// Однако, при снятии пометки удаления все движения становятся активными.
		Если ЭтоНовый() Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = ПометкаУдаления Тогда
			СинхронизироватьПометку = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Активность 		= НЕ ПометкаУдаления;
	НачалоПериода 	= НачалоМесяца(Дата);	
	
	Для Каждого Движение Из Движения Цикл
		
		Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
			// Набор никто не трогал
			Движение.Прочитать();
		КонецЕсли;
		
		Для Каждого Строка Из Движение Цикл
			
			Если СинхронизироватьПометку Тогда
				Если Строка.Активность = Активность Тогда
					Продолжить;
				КонецЕсли;
				
				Строка.Активность   = Активность;
			КонецЕсли;
			
			Строка.Период   = НачалоПериода;
			Движение.Записывать = Истина; // На случай, если набор был прочитан выше
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

// Функция - Данные оплаты
// Возвращаемое значение:
//   - 
Функция ДанныеОплаты();
	
	ТаблицаДанных = новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("ПериодНачисления", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаДанных.Колонки.Добавить("Район", Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	ТаблицаДанных.Колонки.Добавить("МКД", Новый ОписаниеТипов("СправочникСсылка.энргСтроения"));
	ТаблицаДанных.Колонки.Добавить("Абонент", Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	ТаблицаДанных.Колонки.Добавить("ДатаРегистратора", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДанных.Колонки.Добавить("ДокРегистратор", Новый ОписаниеТипов("ДокументСсылка.энргОперацииСПериодамиОспариванияЗадолженности"));
	ТаблицаДанных.Колонки.Добавить("ПериодВзаиморасчетов", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаДанных.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	
	ДанныеРС = Движения.энргПериодыОспариванияЗадолженности;
	Для Каждого ТекСтрока Из ДанныеРС Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		
	КонецЦикла; 	
			
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных",ТаблицаДанных);
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	ТаблицаДанных.Организация КАК Организация,
	|	ТаблицаДанных.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаДанных.Район КАК Район,
	|	ТаблицаДанных.МКД КАК МКД,
	|	ТаблицаДанных.Абонент КАК Абонент,
	|	ТаблицаДанных.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаДанных.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаДанных.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ТаблицаДанных.Услуга КАК Услуга
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Организация КАК Организация,
	|	Данные.ПериодНачисления КАК ПериодНачисления,
	|	Данные.Район КАК Район,
	|	Данные.МКД КАК МКД,
	|	Данные.Абонент КАК Абонент,
	|	Данные.ДатаРегистратора КАК ДатаРегистратора,
	|	Данные.ДокРегистратор КАК ДокРегистратор,
	|	Данные.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	Данные.Услуга КАК Услуга 	
	|ИЗ
	|	Данные КАК Данные";	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
